------
-----
PANDAS
-
-----
---

#IMPORT PANDAS AND NUMPY
import numpy as np
import pandas as pd

In [83]:
import numpy as np
import pandas as pd
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}
print("DICTIONARY : ",d)

DICTIONARY :  {'a': 10, 'b': 20, 'c': 30}

----------------
CREATING A SERIES:
-
----------------

-From nummerical data only
-From numerical data and corresponding index(row labels)
-From numpy array as the source of numerical data
-Just using a pre-defined dictionary

In [86]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [88]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [90]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [92]:
#USING A PRE-DEFINED FUNCTION
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [94]:
print('\nHOLDING NUMERICAL DATA \n','-'*25,sep=" ")
print(pd.Series(arr))

HOLDING NUMERICAL DATA
 -------------------------
0    10
1    20
2    30
dtype: int32

In [96]:
print("\n HOLDING TEXT LABELS \n","-"*20,sep="-")
print(pd.Series(labels))

 HOLDING TEXT LABELS
---------------------
0    a
1    b
2    c
dtype: object

In [98]:
print("\nHOLDING FUNCTIONS \n","-"*20,sep="-")
print(pd.Series(data=[sum,print,len]))

HOLDING FUNCTIONS
---------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [100]:
print("\nHOLDING OBJECTS FROM A DICTIONARY\n","-"*40,sep="")
print(pd.Series(data=[d.keys,d.items,d.values]))

HOLDING OBJECTS FROM A DICTIONARY
----------------------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

-------------------
INDEXING AND SLICING
-
-------------------

In [103]:
#crating two series
s1=pd.Series([1,2,3,4],["ca","or","co","az"])
s2=pd.Series([1,2,5,4],["ca","or","nv","az"])
print(s1,"\n\n",s2)

ca    1
or    2
co    3
az    4
dtype: int64

 ca    1
or    2
nv    5
az    4
dtype: int64

In [105]:
print("\n INDEXING BY NAME OF THE OBJECT(STRING IDENTIFIER)\n","-"*56,sep="-")
print("VALUE OF CA IN S1 :",s1["ca"])
print("VALUE OF AZ IN S1 :",s1["az"])
print("VALUE OF NV IN S! :",s2["nv"])

 INDEXING BY NAME OF THE OBJECT(STRING IDENTIFIER)
---------------------------------------------------------
VALUE OF CA IN S1 : 1
VALUE OF AZ IN S1 : 4
VALUE OF NV IN S! : 5

In [107]:
print("\nINDEXING BY RANGE\n","-"*25,sep="-")
print("VALUE FOR OR,CO & AZ IN S1 :\n",s1[1:4],sep="")

INDEXING BY RANGE
--------------------------
VALUE FOR OR,CO & AZ IN S1 :
or    2
co    3
az    4
dtype: int64

----------
ADDING/MERGING TWO SERIES WITH COMMON INDICES
-
-------------------

In [110]:
s1=pd.Series([1,2,3,4],["ca","or","co","az"])
s2=pd.Series([1,2,5,4],["ca","or","nv","az"])
s3=s1+s2
print("\nAFTER ADDING THE TWO SERIES,THE RESULT LOOKS LIKE THIS :\n","-"*59,sep="-")
print(s3)

AFTER ADDING THE TWO SERIES,THE RESULT LOOKS LIKE THIS :
------------------------------------------------------------
az    8.0
ca    2.0
co    NaN
nv    NaN
or    4.0
dtype: float64

**PYTHON TRIES TO ADD VALUES WHERE IT FINDS COMMON INDEX NAME AND PUTS NaN WHERE INDICES ARE MISSING

In [113]:
print("\nMULITIPLICATION :\n",s1*s2)

MULITIPLICATION :
 az    16.0
ca     1.0
co     NaN
nv     NaN
or     4.0
dtype: float64

In [115]:
print("\nCOMBINATION OF MATHEMATICAL OPERATIONS : \n","-"*40,sep="-")
print(np.exp(s1)+np.log10(s2))

COMBINATION OF MATHEMATICAL OPERATIONS :
-----------------------------------------
az    55.200210
ca     2.718282
co          NaN
nv          NaN
or     7.690086
dtype: float64

---
DATA FRAME (THE REAL MEAT!)
-
---

CREATING AND ACCESSING DATAFRAME : 
-

-INDEXING
-ADDING AND DELETING ROW'S AND COLUMN'S
-SUBSETTING DATA FRAME

In [206]:
from numpy.random import randn as rn

In [231]:
np.random.seed(101)
matrix_data=rn(5,4)
row_labeles=["A","B","C","D","E"]
column_headings=["W","x","Y","Z"]
df=pd.DataFrame(data=matrix_data,index=row_labeles,columns=column_headings)
print("\n THE DATA FRAME LOOKS LIKE :\n","-"*29,sep="-")
print(df)

 THE DATA FRAME LOOKS LIKE :
------------------------------
          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

INDEXING AND SLICING (COLUMNS)
-

- BY BRACKET METHOD
- BY DOT METHOD

In [215]:
print("\nTHE 'X' COLUMN\n","-"*25,sep="-")
print(df["x"])

 THE DATA FRAME LOOKS LIKE :
------------------------------
          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

THE 'X' COLUMN
--------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [217]:
print("\n TYPE OF THE COLUMN :") 
print(type(df['x']))

 TYPE OF THE COLUMN :
<class 'pandas.core.series.Series'>

In [219]:
print("\n The 'x ' and 'z' COLUMNS INDEXED BY PASSING A LIST\n","-"*55)
print(df[['x','Z']])

 The 'x ' and 'z' COLUMNS INDEXED BY PASSING A LIST
 -------------------------------------------------------
          x         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [221]:
print("TYPE OF THE PAIR OF COLUMNS:",type[['x','Z']])

TYPE OF THE PAIR OF COLUMNS: type[['x', 'Z']]

FOR MORE THAN ONE COLUMN , THE OBJECT TURNS INTO A DATAFRAME

In [224]:
print("\nTHE 'X' COLUMN ACCESSED BY DOT METHOD\n","-"*55)
print(df.x)

THE 'X' COLUMN ACCESSED BY DOT METHOD
 -------------------------------------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: x, dtype: float64

CREATING AND DELETING A COLUMN OR ROW
-

In [227]:
print("\nA COLUMN IS CREATED BY ASSIGNING IT IN RELATION TO AN EXISTING COLUMN\n","-"*75)
df['NEW']=df['x']+df['Z']
df['NEW(SUM OF X AND Z)']=df['x']+df['Z']
print(df)

A COLUMN IS CREATED BY ASSIGNING IT IN RELATION TO AN EXISTING COLUMN
 ---------------------------------------------------------------------------
          W         x         Y         Z       NEW  NEW(SUM OF X AND Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958             1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647             0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122             0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184             0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266             2.662266

In [229]:
print("\n A COLUMN IS DROPPED BY USING df.drop() METHOD \n","-"*55)
df.drop('NEW',axis=1)

 A COLUMN IS DROPPED BY USING df.drop() METHOD
 -------------------------------------------------------

          W         x         Y         Z  NEW(SUM OF X AND Z)
A  2.706850  0.628133  0.907969  0.503826             1.131958
B  0.651118 -0.319318 -0.848077  0.605965             0.286647
C -2.018168  0.740122  0.528813 -0.589001             0.151122
D  0.188695 -0.758872 -0.933237  0.955057             0.196184
E  0.190794  1.978757  2.605967  0.683509             2.662266

In [ ]:
df1=df.drop('A')
print("\nA ROW(INDEX) IS DROPPED BY USING df.drop() method and axis=0\n","-"*60)
print(df1)

SELECTING / INDEXING ROWS...!
-

-LABEL-BASED 'loc' METHOD

-INDEX(NUMERIC) 'iloc' METHOD

In [ ]:
print("\nLABEL - BASED 'loc' METHOD CAN BE USED FOR SELECTING ROWS \n","-"*60)
print("\n SINGLE ROW\n")
print(df.loc['C'])

In [ ]:
print("\nMULTIPLE ROWS\n")
print(df.loc[['B','C']])

In [ ]:
print("\n INDEX POSITION BASED 'iloc' method can be used for selecting rows\n","-"*60)
print("\n Single Row\n")
print(df.iloc[2])

In [ ]:
print("MULTIPLE ROWS\n")
print(df.iloc[[1,2]])

SUBSETTING DATAFRAME...!
-

In [ ]:
print("\n THE DATAFRAME\n","-"*45)
print(df)

In [ ]:
print("\nElement at row 'B' and column y is \n","-"*55)
print(df.loc['B','Y'])

CONDITIONAL SELECTION ,INDEX,RESETTING,MULTI-INDEX
-

-BOOLEAN IDEA OF CONDITIONAL CHECK AND BOOLEAN DATAFRAME

In [149]:
print("\nBOOLEAN DATAFRAME WHERE WE ARE CHECKING IFTHE VALUES ARE GRAETER THAN ZERO\n","-"*75)
print(df>0)

BOOLEAN DATAFRAME WHERE WE ARE CHECKING IFTHE VALUES ARE GRAETER THAN ZERO
 ---------------------------------------------------------------------------
       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [151]:
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [153]:
booldf=df>0
print("\nDATAFRAME INDEXED BY BOOLEAN DATAFRAME\n","-"*45)
print(df[booldf])

DATAFRAME INDEXED BY BOOLEAN DATAFRAME
 ---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

PASSING BOOLEAN SERIES TO CONDITIONALLY SUBSET THE DATAFRAME
-

In [156]:
matrix_data=np.matrix('22,60,1;42,70,148;30,62,125;15,68,160;25,62,152');
matrix_data

matrix([[ 22,  60,   1],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 15,  68, 160],
        [ 25,  62, 152]])

In [158]:
row_labels=['A','B','C','D','E']
column_headings=['age','height','weight']
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)
df

   age  height  weight
A   22      60       1
B   42      70     148
C   30      62     125
D   15      68     160
E   25      62     152

In [160]:
print("\n Rows with height>65 inch\n","-"*35,sep="")
print(df[df['height']>65])

 Rows with height>65 inch
-----------------------------------
   age  height  weight
B   42      70     148
D   15      68     160

In [162]:
booldf1=df['height']>65
booldf2=df['weight']>145
print("\n ROWS WITH HEIGHT >65 inch & weight >145\n","-"*55)
print(df[(booldf1) & (booldf2)])

 ROWS WITH HEIGHT >65 inch & weight >145
 -------------------------------------------------------
   age  height  weight
B   42      70     148
D   15      68     160

In [164]:
print("\nDataframe with only age and weight columns whose height >65 inch \n","-"*60)
print(df[booldf1][['age','weight']])

Dataframe with only age and weight columns whose height >65 inch
 ------------------------------------------------------------
   age  weight
B   42     148
D   15     160

RE-SETTING AND SETTING INDEX
-

In [167]:
print("\n AFTER RESETTING INDEX\n","-"*35)
print(df.reset_index())

 AFTER RESETTING INDEX
 -----------------------------------
  index  age  height  weight
0     A   22      60       1
1     B   42      70     148
2     C   30      62     125
3     D   15      68     160
4     E   25      62     152

In [169]:
print("\nAFTER RESETTING INDEX WITH 'DROP' OPTION TRUE\n","-"*45)
print(df.reset_index(drop=True))

AFTER RESETTING INDEX WITH 'DROP' OPTION TRUE
 ---------------------------------------------
   age  height  weight
0   22      60       1
1   42      70     148
2   30      62     125
3   15      68     160
4   25      62     152

In [171]:
print("\nADDING A NEW COLUMN 'PROFESSION'\n",'-'*45)
df['profession']='student teacher engineer doctor nurse'.split()
print(df)

ADDING A NEW COLUMN 'PROFESSION'
 ---------------------------------------------
   age  height  weight profession
A   22      60       1    student
B   42      70     148    teacher
C   30      62     125   engineer
D   15      68     160     doctor
E   25      62     152      nurse

In [173]:
print("\nSetting 'profession' column as index\n","-"*45,sep='')
print(df.set_index('profession'))

Setting 'profession' column as index
---------------------------------------------
            age  height  weight
profession
student      22      60       1
teacher      42      70     148
engineer     30      62     125
doctor       15      68     160
nurse        25      62     152

MULTI-INDEXING
-

In [176]:
#index levels
outside=['61','61','61','62','62','62']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
print("\nTuple pairs after the zip and list command\n","-"*45)
print(hier_index)

Tuple pairs after the zip and list command
 ---------------------------------------------
[('61', 1), ('61', 2), ('61', 3), ('62', 1), ('62', 2), ('62', 3)]

In [178]:
print("\nIndex hirarachy type\n",'-'*25)
print(type(hier_index))

Index hirarachy type
 -------------------------
<class 'list'>

In [180]:
print("\nCREATING DATAFRAME WITH MULTI-INDEXING\n","-"*37)
np.random.seed(101)
df1=pd.DataFrame(data=np.round(rn(6,3),2),index=hier_index,columns=['A','B','C'])
print(df1)

CREATING DATAFRAME WITH MULTI-INDEXING
 -------------------------------------
            A     B     C
(61, 1)  2.71  0.63  0.91
(61, 2)  0.50  0.65 -0.32
(61, 3) -0.85  0.61 -2.02
(62, 1)  0.74  0.53 -0.59
(62, 2)  0.19 -0.76 -0.93
(62, 3)  0.96  0.19  1.98

In [182]:
print("\nNAMING THE INDEXES BY 'INDEX.NAMES' METHOD\n","-"*45)
print(df1)

NAMING THE INDEXES BY 'INDEX.NAMES' METHOD
 ---------------------------------------------
            A     B     C
(61, 1)  2.71  0.63  0.91
(61, 2)  0.50  0.65 -0.32
(61, 3) -0.85  0.61 -2.02
(62, 1)  0.74  0.53 -0.59
(62, 2)  0.19 -0.76 -0.93
(62, 3)  0.96  0.19  1.98

MISSING VALUES
-

In [185]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [187]:
df['states']="CA NV AZ".split()
df.set_index("states",inplace=True)
df

          A    B  C
states
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

PANDAS 'DROPNA' METHOD
-

In [190]:
print("\nDropping any rows with a Nan value\n","-"*35)
print(df.dropna(axis=0))

Dropping any rows with a Nan value
 -----------------------------------
          A    B  C
states
CA      1.0  5.0  1

In [233]:
print("\nDropping any column with a NaN value\n","-"*35)
print(df.dropna(axis=1))

Dropping any column with a NaN value
 -----------------------------------
          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [235]:
print("\nDropping a row with a minimum 2 Nan value using 'thresh' parameter \n","-"*68)
print(df.dropna(axis=0,thresh=2))

Dropping a row with a minimum 2 Nan value using 'thresh' parameter
 --------------------------------------------------------------------
          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

PANDAS FILLNA METHOD
-

In [240]:
print("\nFILLING VALUES WITH A DEFAULT VALUE\n","-"*35)
print(df.fillna(value='FILl VALUE'))

FILLING VALUES WITH A DEFAULT VALUE
 -----------------------------------
          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

GROUPBY METHOD
-

In [252]:
#CREATING A DATAFRAME
data={'company':['goog','goog','msft','msft','fb','fb'],'person':['sam','charlie','any','venessa','car1','sarah'],'sales':[200,120,340,124,243,350]}
data

{'company': ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
 'person': ['sam', 'charlie', 'any', 'venessa', 'car1', 'sarah'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [254]:
df=pd.DataFrame(data)
print(df)

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      any    340
3    msft  venessa    124
4      fb     car1    243
5      fb    sarah    350

In [264]:
bycomp=df.groupby("company")
print("\n Grouping by 'company' column and listing sum of sales\n","-"*55)
print(bycomp.sum())

 Grouping by 'company' column and listing sum of sales
 -------------------------------------------------------
             person  sales
company
fb        car1sarah    593
goog     samcharlie    320
msft     anyvenessa    464

In [266]:
print("ALL IN ONE LINE OF COMMAND(STATS FOR 'FB')","-"*65)
print(pd.DataFrame(df.groupby("company").describe().loc['fb']).transpose())

ALL IN ONE LINE OF COMMAND(STATS FOR 'FB') -----------------------------------------------------------------
   sales
   count   mean        std    min     25%    50%     75%    max
fb   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [268]:
print("\nsame type of extraction with little different command\n","-"*68)
print(df.groupby("company").describe().loc[['goog','msft']])

same type of extraction with little different command
 --------------------------------------------------------------------
        sales
        count   mean         std    min    25%    50%    75%    max
company
goog      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
msft      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

CONCATENATION
-

In [281]:
#CREATING DATA FRAMES
df1=pd.DataFrame({'a':['a0','a1','a2','a3'],'b':['b0','b1','b2','b3'],'c':['c0','c1','c2','c3'],'d':['d0','d1','d2','d3']},index=[0,1,2,3])
df2=pd.DataFrame({'a':['a4','a5','a6','a7'],'b':['b4','b5','b6','b7'],'c':['c4','c5','c6','c7'],'d':['d4','d5','d6','d7']},index=[4,5,6,7])
df3=pd.DataFrame({'a':['a8','a9','a10','a11'],'b':['b8','b9','b10','b11'],'c':['c8','c9','c10','c11'],'d':['d8','d9','d10','d11']},index=[8,9,10,11])
print(df1)
print(df2)
print(df3)

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    a   b   c   d
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7
      a    b    c    d
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [293]:
print("\n AFTER CONCATENATION ALONG ROW\n",'-'*30)
df_cat1=pd.concat([df1,df2,df3],axis=0)
df_cat1

 AFTER CONCATENATION ALONG ROW
 ------------------------------

      a    b    c    d
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [317]:
print("\n AFTER CONCATENATION ALONG COLUMN\n",'-'*30)
df_cat2=pd.concat([df1,df2,df3],axis=1)
df_cat2

 AFTER CONCATENATION ALONG COLUMN
 ------------------------------

      a    b    c    d    a    b    c    d    a    b    c    d
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   d4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   a5   b5   c5   d5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a8   b8   c8   d8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a9   b9   c9   d9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a10  b10  c10  d10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a11  b11  c11  d11

MERGING BY A COMMON KEY
-

THE MERGE FUNCTION ALLOWS YOU TO MERGE DATAFRAMES TOGETHER USING A SIMILAR LOGIC AS MERGING SQL TABLES TOGETHER

In [324]:
left=pd.DataFrame({'key':['c0','c1','c2','c3'],'a':['a0','a1','a2','a3'],"b":['b0','b1','b2','b3']})
print("\nTHE DATAFRAME 'LEFT'\n","-"*30)
left

THE DATAFRAME 'LEFT'
 ------------------------------

  key   a   b
0  c0  a0  b0
1  c1  a1  b1
2  c2  a2  b2
3  c3  a3  b3

In [326]:
right=pd.DataFrame({'key':['c0','c1','c2','c3'],'c':['c0','c1','c2','c3'],"d":['d0','d1','d2','d3']})
print("\nTHE DATAFRAME 'RIGHT'\n","-"*30)
right

THE DATAFRAME 'RIGHT'
 ------------------------------

  key   c   d
0  c0  c0  d0
1  c1  c1  d1
2  c2  c2  d2
3  c3  c3  d3

In [330]:
merge1=pd.merge(left,right,how="inner",on="key")
print("\nAFTER SIMPLE MERGING WITH 'INNER' METHOD \n","-"*50)
merge1

AFTER SIMPLE MERGING WITH 'INNER' METHOD
 --------------------------------------------------

  key   a   b   c   d
0  c0  a0  b0  c0  d0
1  c1  a1  b1  c1  d1
2  c2  a2  b2  c2  d2
3  c3  a3  b3  c3  d3

JOINING
-

JOINING IS A CONVENSENT METHOD FOR COMBINING THE COLUMNS OF TWO DIFFERNTLY  INDEXED DATAFRAMES INTO A SINGLE DATAFRAME BASED ON 'INDEX KEYS'

In [334]:
left=pd.DataFrame({'a':['a0','a1','a2','a3'],"b":['b0','b1','b2','b3']},index=['k1','k2','k3','k4'])
print("\nTHE DATAFRAME 'LEFT'\n","-"*30)
left

THE DATAFRAME 'LEFT'
 ------------------------------

     a   b
k1  a0  b0
k2  a1  b1
k3  a2  b2
k4  a3  b3

In [338]:
right=pd.DataFrame({'c':['c0','c1','c2','c3'],"d":['d0','d1','d2','d3']},index=['k0','k1','k2','k3'])
print("\nTHE DATAFRAME 'RIGHT'\n","-"*30)
right

THE DATAFRAME 'RIGHT'
 ------------------------------

     c   d
k0  c0  d0
k1  c1  d1
k2  c2  d2
k3  c3  d3

In [340]:
print(left.join(right))

     a   b    c    d
k1  a0  b0   c1   d1
k2  a1  b1   c2   d2
k3  a2  b2   c3   d3
k4  a3  b3  NaN  NaN

In [345]:
print(left.join(right,how="outer"))

      a    b    c    d
k0  NaN  NaN   c0   d0
k1   a0   b0   c1   d1
k2   a1   b1   c2   d2
k3   a2   b2   c3   d3
k4   a3   b3  NaN  NaN